<!--
  French translation 
  Translated from default version : browserEnhancementTechnologies.xml (v 1.1)
-->
<section title="Browser Enhancement Technologies">
  <p>
    Je vais essayer de donner un bref aper&#x00E7;u de 4 techniques
    diff&#x00E9;rentes qui peuvent &#x00EA;tre utilis&#x00E9;es pour
    ajouter des fonctions au navigateur. Il est important d'utiliser une
    terminologie correcte pour ne pas faire de confusion.
  </p>
  <p>
    Dans l'ordre du plus simple au plus complexe:
  </p>

  <h3>Application d'Aide</h3>
  <p>
    Une application d'Aide est une application normale qui est
    lanc&#x00E9;e automatiquement quand le navigateur re&#x00E7;oit un
    fichier dont il ne sait pas quoi faire. Le type du fichier est
    identifi&#x00E9; par quelque chose appel&#x00E9; le 'type MIME'.
  </p>
  <p>
    Regardons un exemple en utilisant une installation propre de
    Netscape/Mozilla. (Nous allons dire Netscape/Mozilla parce que
    Internet Explorer a un support 'sp&#x00E9;cial' pour d'autres
    produits MSFT).
  </p>
  <p>
    La premi&#x00E8;re fois que Mozilla re&#x00E7;oit un fichier .doc
    avec le type mime 'application/msword' il ne sait pas quoi faire avec
    ce fichier. Il sait que ce fichier n'est pas de type 'text/html' ou
    'image/jpeg', il ne sait donc pas comment g&#x00E9;rer ce type de
    fa&#x00E7;on native.
  </p>
  <p>
    En cons&#x00E9;quence, Mozilla demande &#x00E0; l'utilisateur si
    il/elle veut sauver le fichier ou lancer une application. Si
    l'utilisateur s&#x00E9;lectionne une application alors il/elle peut
    choisir de toujours lancer cette application quand des fichiers de ce
    type mime sont rencontr&#x00E9;s.
  </p>
  <p>
    Chaque navigateur a sa table d''associations' entre types mime et
    applications ... bien que la table de Safari semble bien cach&#x00E9;e.
  </p>
  <p>
    Une application d'aide peut &#x00EA;tre n'importe quelle application
    ... y compris l'application Jmol.
  </p>
  <p>
    <i>Il faut remarquer que pour que ce sch&#x00E9;ma fonctionne
    r&#x00E9;ellement le serveur web doit &#x00EA;tre configur&#x00E9;
    pour envoyer le bon type mime. Ce n'est g&#x00E9;n&#x00E9;ralement
    pas un probl&#x00E8;me pour les applications majeures. Cependant,
    c'est un probl&#x00E8;me pour les types de fichiers moins connus sur
    les serveurs web avec des administrateurs syst&#x00E8;me novices ...
    ce qui est souvent le cas avec les personnes essayant de construire
    et d&#x00E9;ployer des applications web Chime.</i>
  </p>
  
  <h3>Applet Non V&#x00E9;rifi&#x00E9;e (Non Sign&#x00E9;e)</h3>
  <p>
    C'est une Applet Java qui est int&#x00E9;gr&#x00E9;e dans une page
    web. La plupart des applets non sign&#x00E9;es sont relativement
    petites et se t&#x00E9;l&#x00E9;chargent rapidement. L'utilisateur
    ne les remarque pas vraiment. Il s'agit des petits syst&#x00E8;mes de
    menu, jeux, etc.
  </p>
  <p>
    Ce type d'applet est 'non v&#x00E9;rifi&#x00E9;e' dans le sens
    o&#x00F9; elle provient d'un serveur web quelconque quelque part sur
    le web. En cons&#x00E9;quence nous ne lui faisons pas confiance. En
    cons&#x00E9;quence, les applets non v&#x00E9;rifi&#x00E9;es sont
    plac&#x00E9;es dans un espace s&#x00E9;curis&#x00E9;. Elles ne peuvent
    pas lire ou &#x00E9;crire sur le disque dur local et elles peuvent
    seulement discuter avec le serveur web d'o&#x00F9; elles proviennent.
    Si elles essayent de faire autre chose, elles sont
    imm&#x00E9;diatement d&#x00E9;capit&#x00E9;es.
  </p>
  <p>
    JmolApplet est une applet non v&#x00E9;rifi&#x00E9;e ... plus grosse
    et plus complexe que la plupart des applets non
    v&#x00E9;rifi&#x00E9;es.
  </p>

  <h3>Applet V&#x00E9;rifi&#x00E9;es (ou Sign&#x00E9;es)</h3>
  <p>
    Les restrictions de s&#x00E9;curit&#x00E9; plac&#x00E9;es sur les
    applets non v&#x00E9;rifi&#x00E9;es sont plut&#x00F4;t strictes. Et
    les gens veulent d&#x00E9;velopper des applications web qui peuvent
    faire des choses plus fantaisistes ... comme enregistrer des fichiers
    sur le disque dur local.
  </p>
  <p>
    Avant que ce type d'applet soit ex&#x00E9;cut&#x00E9;, le navigateur
    demande explicitement &#x00E0; l'utilisateur la permission de lancer
    cette applet. En disant oui l'utilisateur donne essentiellement la
    permission au logiciel d'&#x00EA;tre install&#x00E9; sur le disque dur
    local.
  </p>
  <p>
    Pour prot&#x00E9;ger tous les intervenants, une Applet
    V&#x00E9;rifi&#x00E9;e est *sign&#x00E9;e* avec une signature
    num&#x00E9;rique crypt&#x00E9;e. Le cryptage permet aussi de s'assurer
    que le code de l'applet n'a pas &#x00E9;t&#x00E9; modifi&#x00E9; par
    un tiers.
  </p>
  <p>
    Une 'autorit&#x00E9; de certification' est une organisation &#x00E0;
    laquelle vous fa&#x00EE;tes confiance pour la v&#x00E9;rification.
  </p>
  <p>
    Actuellement, il n'y a pas de JmolApplet 'sign&#x00E9;e'. Dans le
    futur, quand il y en aura une, j'irais voir une 'autorit&#x00E9; de
    certification' et leur prouver que je suis membre du projet Jmol.
    Il me donneront alors un jeu de cl&#x00E9; num&#x00E9;rique.
    J'utiliserai alors le jeu de cl&#x00E9;s pour produire une
    SignedJmolApplet.
  </p>
  <p>
    Quand un utilisateur ira sur une page web qui a la SignedJmolApplet,
    le navigateur lui demandera si il fait confiance &#x00E0; l'applet.
    Il dira 'oui' et la session continuera.
  </p>
  <p>
    La SignedJmolApplet qui est install&#x00E9;e sur le disque dur peut
    maintenant lire/&#x00E9;crire des fichiers sur le disque dur. Elle
    peut aussi lire/&#x00E9;crire des donn&#x00E9; sur n'importe quel
    endroit du web.
  </p>
  <p>
    Ceci donnera &#x00E0; la SignedJmolApplet beaucoup plus de marge pour
    faire des choses int&#x00E9;ressantes ... comme lire des fichiers de
    mod&#x00E8;les mol&#x00E9;culaires locaux ... ou extraire directement
    des fichiers depuis des bases de donn&#x00E9;es sur le web.
  </p>
  <p>
    Il faut noter que cette SignedJmolApplet n'est toujours qu'une applet
    qui n'existe <i>que</i> dans le contexte d'une page web
    particuli&#x00E8;re. Ce n'est pas une application arbitraire qui
    peut &#x00EA;tre lanc&#x00E9;e &#x00E0; n'importe quel moment.
  </p>
  <p>
    Un utilisateur ne peut pas l'ex&#x00E9;cuter &#x00E0; moins qu'elle ne
    fasse partie d'une page web &#x00E0; laquelle ils ont acc&#x00E8;s.
    Cependant, ceci devrait inclure une page web qui provient d'un
    CR-ROM ou qui est stock&#x00E9;e sur un syst&#x00E8;me de fichiers
    local.
  </p>
  <p>
    Dans le futur, nous esp&#x00E9;rons avoir une SignedJmolApplet.
    Cependant, nous voudrons conserver la JmolApplet non sign&#x00E9;e
    pour ceux qui veulent construire des sites web plus simples qui ne
    n&#x00E9;cessitent pas de permission explicite pour &#x00E9;crire
    sur le disque dur local.
  </p>
  <p>
    J'aimerais que la JmolApplet soit 'simple' ... avec des fonctions
    limit&#x00E9;es ... mais un bon support pour simplement afficher
    des mol&#x00E9;cules pour les &#x00E9;tudiants d&#x00E9;butants et
    les visiteurs occasionnels.
  </p>
  <p>
    La SignedJmolApplet sera pour les utilisateurs s&#x00E9;rieux qui
    veulent plus de fonctions.
  </p>

  <h3>Plug-in</h3>
  <p>
    Pour comprendre un plug-in il est utile de se rappeler l'application
    d'aide. Une application d'aide n'est pas associ&#x00E9;e &#x00E0; une
    page web sp&#x00E9;cifique. Au contraire, elle est associ&#x00E9;e
    &#x00E0; un type de fichier particulier, un type mime particulier. Le
    navigateur web lancera MS Word chaque fois qu'il voit un document
    avec le type mime 'application/msword'.
  </p>
  <p>
    Un plug-in fonctionne de fa&#x00E7;on similaire. Mais l'affichage
    des donn&#x00E9;es est inclus dans la fen&#x00EA;tre du navigateur.
    A un certain niveau, il s'agit d'un logiciel qui &#x00E9;tend les
    capacit&#x00E9;s du navigateur lui-m&#x00EA;me. D'o&#x00F9; viennent
    les fichier ne compte pas. Quand le navigateur voit un type mime non
    natif il peut v&#x00E9;rifier sa liste de plug-ins install&#x00E9;s et
    voir si l'un d'entre eux peut le g&#x00E9;rer.
  </p>
  <p>
    Deux exemples populaires sont Flash et Acrobat Reader. Les gens
    installent g&#x00E9;n&#x00E9;ralement ces choses une fois et ne s'en
    occupe plus.
  </p>
  <p>
    Une fois qu'un plug-in est install&#x00E9; il peut faire tout ce qu'il
    veut comme n'importe quel logiciel install&#x00E9;.
  </p>
  <p>
    D&#x00E9;velopper et maintenir des plug-ins est tr&#x00E8;s
    co&#x00FB;teux et cher. Bien que Netscape ait d&#x00E9;fini une API
    de plug-in, le fait est que le comportement dynamique de chaque
    navigateur sur chaque plateforme est diff&#x00E9;rent. Et beaucoup de
    navigateurs 'impl&#x00E9;mentent/supportent' l'API de Plug-in
    Netscape, mais ce sont des impl&#x00E9;mentations diff&#x00E9;rentes
    et elles ont des comportements diff&#x00E9;rents. Le probl&#x00E8;me
    fondamental est que vous essayez de prendre une bout de logiciel
    compliqu&#x00E9; (votre joli plug-in) et de l'inclure dans une autre
    bout de logiciel compliqu&#x00E9; (le navigateur web), &#x00E0;
    c&#x00F4;t&#x00E9; d'autres plug-ins. Et, en g&#x00E9;n&#x00E9;ral,
    vous partagez la m&#x00EA;me m&#x00E9;moire et certaines des
    m&#x00EA;mes structures de donn&#x00E9;es. En cons&#x00E9;quence,
    quand quelqu'un fait une erreur, les choses ont tendance &#x00E0;
    casser.
  </p>
  <p>
    En &#x00E9;crivant ceci il devient plus clair qu'avant qu'un Plug-in
    Jmol n'existera jamais.
  </p>
  <p>
    C'est suffisant pour maintenant.
  </p>
</section>
